# Работа с переменными (числа)
num = 5 #   = - оператор присваивания
count1= count2 = count3 = 0 # Присваивание одного значения нескольким переменным
num1, num2, num3 = 1, 2, 3 # Распаковка нескольких значений в несколько переменных
#Swap для C/C++
a, b = 5, 4
a, b = b, a #
c = a
a = b
b = c
print(a, b )

# Swap for Python
a, b = b, a

# Арифметические операции
num4 , num5 = 17, 5

summ = num4 + num5 # сумма
sub = num4 - num5 # вычитание
mult = num * num5 # умножение
step = num4 ** num5 # возведение в степень
dell = num4 / num5 # дробное деление
div = num4 // num5 # целочисленное деление
mod = num4 % num5 # остаток от деления
k = num4 & num5 #  побитовая / поразрядная конъюнкция
d =  num4 | num5 # побитовая / поразрядная дизъюнкция








